import re

names = []
roll_no = ["ဆမဥ", "ဆမမ", "ဆမရ", "ဆမဝ", "ဆမ", "ဆရက", "ဆတဥ", "ဆသက", "ဆသဝ", "ဆဗထ", "ဆပဇ", "ဆမ",
           "ဆတည", "ဆသတ", "ဆဒပ", "ဆဒဆ", "ဆဒတ", "ဆဒထ", "ဆဒမ", "ဆဒရ", "ဆကရ", "ဆလမ", "ဆမက",
           "ဆမတ", "ဆအလ", "ဆစခ", "ဆလတ", "ဆလသ", "ဆပတ", "ဆကတ", "ဆဒဂ", "ဆလသ", "ဆပတ", "ဆကတ",
           "ဆဒဂ", "ဆဗဟ", "ဆ၀သ", "ဆဝဖ", "ဆဝဖ", "ဆဂရ", "ဆဂဃ", "ဆဂယ", "ဆခက",
           "ဆခဇ", "ဆရ", "ဆရဒ", "ဆရပ", "ဆရမ", "ဆရရ", "ဆဏခ", "ဆဏ", "ဆဏတ", "ဆဏထ", "ဆဏဘ", "ဆဏရ",
           "ဆည", "ဆနက", "ဆနခ", "ဆနတ", "ဆင", "ဆစ", "ဆငဏ", "ဆမတ", "ဆင၀", "ဆအစ", "ဆအဆ",
           "ဆအဓ", "ဆအန", "ဆအပ", "ဆအမ", "ဆအအ", "ဆဥဒ", "ဆဥဓ", "ဆဥက", "ဆဥလ", "ဆဥသ", "ဆဥမ" , "ဆသယ",
           "ဆသအ", "ဆသဥ", "ဆသဇ", "ဆဧသ", "ဆဇသ", "ဆဇဟ", "ဆဇအ", "ဆဃန", "ဆဃဘ", "ဆဃမ", "ဆဃရ", "ဆဘဓ",
           "ဆဘဗ","ဆဘဥ", "ဆထဆ", "ဆထတ", "ဆထန", "ဆထရ", "ဆထလ","ဆဖစ", "ဆဖဆ", "ဆဖဒ", "ဆဖလ", "ဆဖအ",
           "ဆဖဇ",
           "ဆသ", "ဆမ", "ဆဥ", "ဆန", "ဆဆ", "ဆခ",  "ဆလ", "ဆပ", "ဆဂ", "ဆဃ", "ဆဘ", "ဆာဗ", "ဆထ", "ဆဖ"]
distinctions = ["ဇီဝဗေဒ", "ဓာတုဗေဒ", "ရူပဗေဒ", "မြန်မာစာ", "အင်္ဂလိပ်", "သင်္ချာ", "ဘောဂဗေဒ", "ပထဝီဝင်", "သမိုင်း"]
with open("data/raw-text/2019/YG.txt.txt", encoding="utf-8") as file:
    for line in file.readlines():
        text = re.sub("|".join(distinctions), "", line)
        text = re.sub("၊", "", text)
        text = re.sub("၀|၁|၂|၃|၄|၅|၆|၇|၈|၉", "ဆမဥ", text)
        cnames = re.split('|'.join(roll_no), text)
        for n in cnames:
            if len(n.strip()) < 2:
                continue
            if n.startswith("ဝ"):
                n = n.lstrip("ဝ")
            if len(n) > 2 and len(n) < 30:
                if n.startswith("မ") or n.startswith("မောင်"):
                    names.append(n.strip()+"\n")
            elif n.startswith("မ") or n.startswith("မောင်"):
                print(n)

with open("data/processed-text/2019/YG.txt", "w", encoding="utf-8") as file:
    file.writelines(names)


